1s/ERP/extensions/liko/Reports/Лико_ИсторияКонвертовИФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>Лико_ИсторияКонвертовИФорм</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конверт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Конверты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

1s/ERP/extensions/liko/Reports/Лико_ИсторияКонвертовИФорм/Forms/ФормаОтчетаУПР/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьОтчет() //+Лико m.shenderov 30.03.2018
	УстановитьПривилегированныйРежим(Истина);
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ОтчетОбъект.ПолучитьМакет("Макет");

	//Макет = ПолучитьМакет("Макет");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьРаздел = Макет.ПолучитьОбласть("Раздел");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабДок = Новый ТабличныйДокумент;
	
	ОбластьЗаголовок.Параметры.ТекущееВремя = ТекущаяДата();
	ОбластьЗаголовок.Параметры.ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ЗапросДвижений = Новый Запрос;
	ЗапросДвижений.Текст =  
	"ВЫБРАТЬ
	|	Лико_ИсторияДвиженийФорм.Период КАК Дата,
	|	Лико_ИсторияДвиженийФорм.Форма.Заказ.НомерБезПрефикса КАК НомерЗаказаПриема,
	|	ФормыКонверта.КодФормы7 КАК КодФормы7,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Лико_ИсторияДвиженийФорм.Форма) КАК КоличествоФорм,
	|	Лико_ИсторияДвиженийФорм.Форма.Контрагент КАК Контрагент,
	|	Лико_ИсторияДвиженийФорм.Форма.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(Лико_ИсторияДвиженийФорм.Форма.Заказ.Комментарий КАК СТРОКА(100)) КАК Комментарий,
	|	Лико_ИсторияДвиженийФорм.Регистратор.ВидОперации КАК ВидОперации,
	|	Лико_ИсторияДвиженийФорм.ЗаказПокупателя.НомерБезПрефикса КАК НомерЗаказаОперации,
	|	Лико_ИсторияДвиженийФорм.Ответственный КАК Оператор,
	|	Лико_ИсторияДвиженийФорм.Регистратор.Сотрудник КАК Сотрудник,
	|	Лико_ИсторияДвиженийФорм.Расположение КАК Расположение,
	|	Лико_ИсторияДвиженийФорм.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВсеФормыСКонвертами.Форма КАК Форма,
	|		ПОДСТРОКА(ВсеФормыСКонвертами.Форма.Код, 1, 7) КАК КодФормы7
	|	ИЗ
	|		(ВЫБРАТЬ
	|			Лико_ИсторияДвиженийФорм.Форма КАК Форма,
	|			Лико_ИсторияДвиженийФорм.Расположение КАК Конверт
	|		ИЗ
	|			РегистрСведений.Лико_ИсторияДвиженийФорм КАК Лико_ИсторияДвиженийФорм
	|		ГДЕ
	|			Лико_ИсторияДвиженийФорм.Организация = &Организация
	|			И Лико_ИсторияДвиженийФорм.Расположение ССЫЛКА Справочник.Лико_Конверты) КАК ВсеФормыСКонвертами
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА &Конверт = ЗНАЧЕНИЕ(Справочник.Лико_Конверты.ПустаяСсылка)
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ВсеФормыСКонвертами.Конверт = &Конверт
	|			КОНЕЦ) КАК ФормыКонверта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ИсторияДвиженийФорм КАК Лико_ИсторияДвиженийФорм
	|		ПО ФормыКонверта.Форма = Лико_ИсторияДвиженийФорм.Форма
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ИсторияДвиженийФорм.Период,
	|	Лико_ИсторияДвиженийФорм.Форма.Контрагент,
	|	Лико_ИсторияДвиженийФорм.Регистратор.ВидОперации,
	|	Лико_ИсторияДвиженийФорм.Ответственный,
	|	Лико_ИсторияДвиженийФорм.Регистратор.Сотрудник,
	|	Лико_ИсторияДвиженийФорм.Расположение,
	|	Лико_ИсторияДвиженийФорм.Регистратор,
	|	Лико_ИсторияДвиженийФорм.Форма.Номенклатура,
	|	ВЫРАЗИТЬ(Лико_ИсторияДвиженийФорм.Форма.Заказ.Комментарий КАК СТРОКА(100)),
	|	ФормыКонверта.КодФормы7,
	|	Лико_ИсторияДвиженийФорм.Форма.Заказ.НомерБезПрефикса,
	|	Лико_ИсторияДвиженийФорм.ЗаказПокупателя.НомерБезПрефикса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лико_ИсторияДвиженийФорм.Период,
	|	Лико_ИсторияДвиженийФорм.Форма.Заказ.НомерБезПрефикса,
	|	ФормыЗаказаПриема.КодФормы7,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Лико_ИсторияДвиженийФорм.Форма),
	|	Лико_ИсторияДвиженийФорм.Форма.Контрагент,
	|	Лико_ИсторияДвиженийФорм.Форма.Номенклатура,
	|	ВЫРАЗИТЬ(Лико_ИсторияДвиженийФорм.Форма.Заказ.Комментарий КАК СТРОКА(100)),
	|	Лико_ИсторияДвиженийФорм.Регистратор.ВидОперации,
	|	Лико_ИсторияДвиженийФорм.ЗаказПокупателя.НомерБезПрефикса,
	|	Лико_ИсторияДвиженийФорм.Ответственный,
	|	Лико_ИсторияДвиженийФорм.Регистратор.Сотрудник,
	|	Лико_ИсторияДвиженийФорм.Расположение,
	|	Лико_ИсторияДвиженийФорм.Регистратор
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ВсеФормыСЗаказамиПриема.Форма КАК Форма,
	|		ПОДСТРОКА(ВсеФормыСЗаказамиПриема.Форма.Код, 1, 7) КАК КодФормы7
	|	ИЗ
	|		(ВЫБРАТЬ
	|			Лико_Формы.Ссылка КАК Форма,
	|			Лико_Формы.Заказ.НомерБезПрефикса КАК НомерЗаказа
	|		ИЗ
	|			Справочник.Лико_Формы КАК Лико_Формы) КАК ВсеФормыСЗаказамиПриема
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Формы КАК ЗаказКлиентаФормы
	|			ПО ВсеФормыСЗаказамиПриема.Форма = ЗаказКлиентаФормы.Значение
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА &НомерЗаказа = 0
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ЗаказКлиентаФормы.Ссылка.НомерБезПрефикса = &НомерЗаказаСтрока
	|						ИЛИ ВсеФормыСЗаказамиПриема.НомерЗаказа = &НомерЗаказаСтрока
	|			КОНЕЦ) КАК ФормыЗаказаПриема
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ИсторияДвиженийФорм КАК Лико_ИсторияДвиженийФорм
	|		ПО ФормыЗаказаПриема.Форма = Лико_ИсторияДвиженийФорм.Форма
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ИсторияДвиженийФорм.Период,
	|	Лико_ИсторияДвиженийФорм.Ответственный,
	|	Лико_ИсторияДвиженийФорм.Расположение,
	|	Лико_ИсторияДвиженийФорм.Регистратор,
	|	Лико_ИсторияДвиженийФорм.Форма.Контрагент,
	|	Лико_ИсторияДвиженийФорм.Регистратор.ВидОперации,
	|	Лико_ИсторияДвиженийФорм.Регистратор.Сотрудник,
	|	Лико_ИсторияДвиженийФорм.Форма.Номенклатура,
	|	ВЫРАЗИТЬ(Лико_ИсторияДвиженийФорм.Форма.Заказ.Комментарий КАК СТРОКА(100)),
	|	ФормыЗаказаПриема.КодФормы7,
	|	Лико_ИсторияДвиженийФорм.Форма.Заказ.НомерБезПрефикса,
	|	Лико_ИсторияДвиженийФорм.ЗаказПокупателя.НомерБезПрефикса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лико_ИсторияДвиженийФорм.Период,
	|	Лико_ИсторияДвиженийФорм.Форма.Заказ.НомерБезПрефикса,
	|	ФормыЗаказаОперации.КодФормы7,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Лико_ИсторияДвиженийФорм.Форма),
	|	Лико_ИсторияДвиженийФорм.Форма.Контрагент,
	|	Лико_ИсторияДвиженийФорм.Форма.Номенклатура,
	|	ВЫРАЗИТЬ(Лико_ИсторияДвиженийФорм.Форма.Заказ.Комментарий КАК СТРОКА(100)),
	|	Лико_ИсторияДвиженийФорм.Регистратор.ВидОперации,
	|	Лико_ИсторияДвиженийФорм.ЗаказПокупателя.НомерБезПрефикса,
	|	Лико_ИсторияДвиженийФорм.Ответственный,
	|	Лико_ИсторияДвиженийФорм.Регистратор.Сотрудник,
	|	Лико_ИсторияДвиженийФорм.Расположение,
	|	Лико_ИсторияДвиженийФорм.Регистратор
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВсеФормыСЗаказамиОперации.Форма КАК Форма,
	|		ПОДСТРОКА(ВсеФормыСЗаказамиОперации.Форма.Код, 1, 7) КАК КодФормы7
	|	ИЗ
	|		(ВЫБРАТЬ
	|			Лико_ИсторияДвиженийФорм.Форма КАК Форма,
	|			Лико_ИсторияДвиженийФорм.ЗаказПокупателя.НомерБезПрефикса КАК НомерЗаказа
	|		ИЗ
	|			РегистрСведений.Лико_ИсторияДвиженийФорм КАК Лико_ИсторияДвиженийФорм) КАК ВсеФормыСЗаказамиОперации
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА &НомерЗаказа = 0
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ВсеФормыСЗаказамиОперации.НомерЗаказа ПОДОБНО &НомерЗаказаСтрока + ""%""
	|			КОНЕЦ) КАК ФормыЗаказаОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ИсторияДвиженийФорм КАК Лико_ИсторияДвиженийФорм
	|		ПО ФормыЗаказаОперации.Форма = Лико_ИсторияДвиженийФорм.Форма
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ИсторияДвиженийФорм.Ответственный,
	|	Лико_ИсторияДвиженийФорм.Период,
	|	Лико_ИсторияДвиженийФорм.Расположение,
	|	Лико_ИсторияДвиженийФорм.Регистратор,
	|	Лико_ИсторияДвиженийФорм.Форма.Контрагент,
	|	Лико_ИсторияДвиженийФорм.Регистратор.ВидОперации,
	|	Лико_ИсторияДвиженийФорм.Регистратор.Сотрудник,
	|	Лико_ИсторияДвиженийФорм.Форма.Номенклатура,
	|	ВЫРАЗИТЬ(Лико_ИсторияДвиженийФорм.Форма.Заказ.Комментарий КАК СТРОКА(100)),
	|	ФормыЗаказаОперации.КодФормы7,
	|	Лико_ИсторияДвиженийФорм.Форма.Заказ.НомерБезПрефикса,
	|	Лико_ИсторияДвиженийФорм.ЗаказПокупателя.НомерБезПрефикса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лико_ИсторияДвиженийФорм.Период,
	|	Лико_ИсторияДвиженийФорм.Форма.Заказ.НомерБезПрефикса,
	|	ФормыЗаказаПоКоду.КодФормы7,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Лико_ИсторияДвиженийФорм.Форма),
	|	Лико_ИсторияДвиженийФорм.Форма.Контрагент,
	|	Лико_ИсторияДвиженийФорм.Форма.Номенклатура,
	|	ВЫРАЗИТЬ(Лико_ИсторияДвиженийФорм.Форма.Заказ.Комментарий КАК СТРОКА(100)),
	|	Лико_ИсторияДвиженийФорм.Регистратор.ВидОперации,
	|	Лико_ИсторияДвиженийФорм.ЗаказПокупателя.НомерБезПрефикса,
	|	Лико_ИсторияДвиженийФорм.Ответственный,
	|	Лико_ИсторияДвиженийФорм.Регистратор.Сотрудник,
	|	Лико_ИсторияДвиженийФорм.Расположение,
	|	Лико_ИсторияДвиженийФорм.Регистратор
	|ИЗ
	|	(ВЫБРАТЬ
	|		Лико_Формы.Ссылка КАК Форма,
	|		ПОДСТРОКА(Лико_Формы.Код, 1, 7) КАК КодФормы7
	|	ИЗ
	|		Справочник.Лико_Формы КАК Лико_Формы
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА &НомерЗаказаСтрока = """"
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ Лико_Формы.Код ПОДОБНО &НомерЗаказаСтрока + ""%""
	|			КОНЕЦ) КАК ФормыЗаказаПоКоду
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ИсторияДвиженийФорм КАК Лико_ИсторияДвиженийФорм
	|		ПО ФормыЗаказаПоКоду.Форма = Лико_ИсторияДвиженийФорм.Форма
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ИсторияДвиженийФорм.Форма.Контрагент,
	|	Лико_ИсторияДвиженийФорм.Форма.Номенклатура,
	|	ВЫРАЗИТЬ(Лико_ИсторияДвиженийФорм.Форма.Заказ.Комментарий КАК СТРОКА(100)),
	|	Лико_ИсторияДвиженийФорм.Регистратор.ВидОперации,
	|	Лико_ИсторияДвиженийФорм.Ответственный,
	|	Лико_ИсторияДвиженийФорм.Регистратор.Сотрудник,
	|	Лико_ИсторияДвиженийФорм.Расположение,
	|	Лико_ИсторияДвиженийФорм.Регистратор,
	|	Лико_ИсторияДвиженийФорм.Период,
	|	ФормыЗаказаПоКоду.КодФормы7,
	|	Лико_ИсторияДвиженийФорм.Форма.Заказ.НомерБезПрефикса,
	|	Лико_ИсторияДвиженийФорм.ЗаказПокупателя.НомерБезПрефикса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Вт.Дата КАК Дата,
	|	Вт.НомерЗаказаПриема КАК НомерЗаказаПриема,
	|	Вт.КодФормы7 КАК КодФормы7,
	|	Вт.КоличествоФорм КАК КоличествоФорм,
	|	Вт.Контрагент КАК Контрагент,
	|	Вт.Номенклатура КАК Номенклатура,
	|	Вт.Комментарий КАК Комментарий,
	|	Вт.ВидОперации КАК ВидОперации,
	|	Вт.НомерЗаказаОперации КАК НомерЗаказаОперации,
	|	Вт.Оператор КАК Оператор,
	|	Вт.Сотрудник КАК Сотрудник,
	|	Вт.Расположение КАК Расположение,
	|	Вт.Регистратор КАК Регистратор
	|ИЗ
	|	Вт КАК Вт
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ ПО
	|	КодФормы7,
	|	Номенклатура,
	|	Комментарий";
	ЗапросДвижений.УстановитьПараметр("Организация", Отчет.Организация);
	ЗапросДвижений.УстановитьПараметр("НомерЗаказа", Отчет.НомерЗаказа);
	ЗапросДвижений.УстановитьПараметр("НомерЗаказаСтрока", Строка(Формат(Отчет.НомерЗаказа, "ЧГ=0")));
	ЗапросДвижений.УстановитьПараметр("Конверт", Отчет.Конверт);
	
	РезультатДвижений = ЗапросДвижений.Выполнить();
	Если Не РезультатДвижений.Пустой() Тогда
		ВыборкаПоКодуФормы7 = РезультатДвижений.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоКодуФормы7.Следующий() Цикл
			
			//ВыборкаПоСпецификации = ВыборкаПоКодуФормы7.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			//Пока ВыборкаПоСпецификации.Следующий() Цикл
				
				ВыборкаПоНоменклатуре = ВыборкаПоКодуФормы7.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоНоменклатуре.Следующий() Цикл
				
				ВыборкаПоКомментарию = ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоКомментарию.Следующий() Цикл
					
					ОбластьРаздел.Параметры.Заполнить(ВыборкаПоКомментарию);
					ТабДок.Вывести(ОбластьРаздел);
					
					ВыборкаДвижение = ВыборкаПоКомментарию.Выбрать(ОбходРезультатаЗапроса.Прямой);
					Пока ВыборкаДвижение.Следующий() Цикл
						
						ОбластьСтрока.Параметры.Заполнить(ВыборкаДвижение);
						ТабДок.Вывести(ОбластьСтрока);
						
					КонецЦикла; 
					
				КонецЦикла;
				
				КонецЦикла;
				
			//КонецЦикла;
			
		КонецЦикла;	//выборка запроса Движений
	Иначе 	//запрос пуст!
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ТабДок);
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	
	
	
КонецПроцедуры  //-Лико m.shenderov 30.03.2018


&НаКлиенте
Процедура СформироватьОтчет1(Команда)
	СформироватьОтчет();
КонецПроцедуры
